@pages = [
  # PROJECTS
  {
    type: 'Project',
    head: 'ERDE',
    lead: 'Веб сервис подачи документов на визу',
    previewtext: 'веб сервис подачи документов на визу',
    tag: 'ПРОДУКТ',
    author: 'Казьмина Анастасия, Белоусова Анна',
    cover: 'Erde.jpg',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'Erde.jpg'
  },
  {
    type: 'Project',
    head: 'NETSTORY',
    lead: 'All you need to know about history of the internet',
    previewtext: 'история развития интернета',
    tag: 'ПРОДУКТ',
    author: 'Шумилова Ольга, Кочуева Оксана, Котенкова Анна',
    cover: 'NetStory.jpg',
    description: 'Что каждый из нас знает об интернете? Что это всемирная информационная компьютерная сеть, пользователями которой являются 4 миллиарда человек? А ведь в  2019 году интернет отпраздновал свой юбилей, вот уже больше 30 лет он соединяет людей по всему миру, но нам так мало известно о том, как развивался интернет и каким он был до сегодняшнего дня.',
    squarecover: 'NetStory.jpg'
  },
  {
    type: 'Project',
    head: 'SSYLKY',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    previewtext: 'сервис для хранения ссылок',
    tag: 'ПРОДУКТ',
    author: 'Воронина Александра, Никитина Екатерина, Антоова Нина',
    cover: 'Ssylki.jpg',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'Ssylki.jpg'
  },
  {
    type: 'Project',
    head: 'GIFTCATCHER',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'КОНЦЕПТ',
    author: 'Воронина Александра',
    cover: 'Giftcatcher.jpg',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'Giftcatcher.jpg'
  },
  {
    type: 'Project',
    head: 'META',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'ПРОЕКТИРОВАНИЕ',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    cover: 'Meta.jpg',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'Meta.jpg'
  },
  {
    type: 'Project',
    head: 'RUKZAK',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'КОНЦЕПТ',
    author: 'Крюченко Андрей, Зяббарова Лолита, Мартынова София',
    cover: 'Rukzak.jpg',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'Rukzak.jpg'
  },

  # ARTICLES
  {
    type: 'Article',
    head: 'ОРГАНИЗАЦИЯ РАБОЧЕГО ПРОСТРАНСТВА В ТРЕЛЛО',
    lead: 'Рассказ о развитии продукта и первых шагах в разработке методологии',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    cover: 'M_ArticleCard-8.png',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    partial_name: 'second'
  },
  {
    type: 'Article',
    head: 'ВЁРСТКА САЙТОВ. С ЧЕГО НАЧАТЬ',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'M_ArticleCard-7.png'
  },
  {
    type: 'Article',
    head: 'UNIVERSAL DESIGN FRAMEWORK. ТЕЗИС',
    lead: 'Рассказ о развитии продукта и первых шагах в разработке методологии',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    cover: 'M_ArticleCard-9.png',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.'
  },
  {
    type: 'Article',
    head: 'ПЕРВЫЕ ШАГИ В СОЗДАНИИ ПРОДУКТА',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'Design',
    cover: 'M_ArticleCard.png',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.'
  },
  {
    type: 'Article',
    head: 'REACT/REDUX СТРУКТУРЫ',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'M_ArticleCard-6.png'
  },
  {
    type: 'Article',
    head: 'ДИЗАЙН СИСТЕМЫ В SKETCH И FIGMA',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'M_ArticleCard-2.png'
  },
  {
    type: 'Article',
    head: 'UX, CX, EX – СЕРВИСНЫЙ ДИЗАЙН',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'M_ArticleCard-1.png'
  },
  {
    type: 'Article',
    head: 'ИСПОЛЬЗУЕМ ATOM ДЛЯ ПЕРВОЙ ВЕРСТКИ',
    lead: 'Рассказ о развитии продукта и первых шагах в разработке методологии',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    cover: 'M_ArticleCard-3.png',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.'
  },
  {
    type: 'Article',
    head: 'МОДУЛЬНЫЕ СЕТКИ В РАБОТЕ UX-ДИЗАЙНЕРА',
    lead: 'Рассказ о развитии продукта и первых шагах в разработке методологии',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    cover: 'M_ArticleCard-4.png',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.'
  },
  {
    type: 'Article',
    head: 'UX/UI В КОМПАНИИ',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
    squarecover: 'M_ArticleCard-10.png'
  },
  {
    type: 'Article',
    head: 'РУКОВОДСТВО ПО USER STORY MAPPING',
    lead: 'Сервис для распределения виртуального имущества при жизни',
    tag: 'Design',
    author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
    cover: 'M_ArticleCard-5.png',
    description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.'
  }
]
# projects: [
#   {
#     head: 'META',
#     lead: 'Сервис для распределения виртуального имущества при жизни',
#     tag: 'Design',
#     author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
#     cover: 'meta.jpg',
#     description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
#     squarecover: 'meta.jpg'
#   }
# ],
# articles: [
#   {
#     head: 'META2',
#     lead: 'Сервис для распределения виртуального имущества при жизни',
#     tag: 'Design',
#     author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
#     cover: 'meta.jpg',
#     description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
#     squarecover: 'meta.jpg'
#   }
# ]

def seed_data
  drop_db
  drop_uploads
  create_pages
  create_admin
end
# Reset Database
def drop_db
  Rake::Task['db:drop'].invoke
  Rake::Task['db:create'].invoke
  Rake::Task['db:migrate'].invoke
end

def drop_uploads
  folders = Dir.glob(File.join(Rails.root, 'public/uploads/*'))
  folders.each { |f| FileUtils.rm_rf(f) }
end

# def create_projects
#   p = Project.create([{
#     head: 'META',
#     lead: 'Сервис для распределения виртуального имущества при жизни',
#     tag: 'Design',
#     author: 'Прокофьева Татьяна, Мартынова Софья, Зяббарова Лолита',
#     cover: 'meta.jpg',
#     description: 'Все началось с коллективного брейнсторма на одной из первых пар по креативному проектированию на втором курсе. Вариантов было очень много, но как только мы погружались в них глубже, каждый раз оказывалось, что в целом у них уже были неплохие решения. <br> Очередной велосипед придумывать не хотелось, и тогда мы решили представить, о чем обычно не думают, в диджитал контексте. И тогда в голову стали приходить мысли об экзистенциальом, в часности пришло Завещание.',
#     squarecover: 'meta.jpg'
#   }])
#   puts "Article just created with"
# end

def create_pages
  @pages.each_with_index do |page, index|
    if page[:cover].present?
      page[:cover] = upload_page_cover(page[:cover])
    end
    if page[:squarecover].present?
      page[:squarecover] = upload_page_squarecover(page[:squarecover])
    end
    p = Page.create!(page)
    puts "#{p.id}"
  end
  # pages.shuffle.each_with_index do |page, index|
  #     r = page.article.create!(article)
  #     r = page.project.create!(project)
  #   end
  #   puts 'YOOOOOOOOO'
  # end
end

def upload_page_cover(filename)
  cover_uploader = CoverUploader.new(Page.new, :cover)
  cover_uploader.cache!(File.open(File.join(Rails.root, "public/seed_images/covers/#{ filename }")))
  # cover_uploader.cache!(File.open(Dir.glob(File.join(Rails.root, "public/seed_images/covers/*")).sample))
  cover_uploader
end

def upload_page_squarecover(filename)
  squarecover_uploader = SquarecoverUploader.new(Page.new, :squarecover)
  squarecover_uploader.cache!(File.open(File.join(Rails.root, "public/seed_images/squarecovers/#{ filename }")))
  # squarecover_uploader.cache!(File.open(Dir.glob(File.join(Rails.root, "public/seed_images/squarecovers/*")).sample))
  squarecover_uploader
end

# def create_pages
#   @pages.each_with_index do |page, index|
#     p = Page.create!(page)
#     puts "Page just created"
#     @pages[index][:id] = p.id
#
#     create_articles(p, page[:articles])
#     create_projects(p, page[:projects])
#   end
# end

# def create_articles
#   articles.each_with_index do |article, i|
#     a = Article.create!(article)
#     puts "Article created"
#   end
# end
#
# def create_projects
#   projects.each_with_index do |project, i|
#     pr = Project.create!(project)
#     puts "Project created"
#   end
# end

def create_admin
  password = '123456'

  admin = User.create(
  email: 'admin@admin.admin',
  admin: true,
  password: password,
  password_confirmation: password
)

puts "Admin with email #{ admin.email } was created"
end

seed_data
